Tekla Open API Reference for Tekla Structures 2025
MultiDrawing Methods
The MultiDrawing type exposes the following members.
Methods
Name | Description
CommitChanges()
 Commits the changes made to the drawings database so far. Commit inserts a kind of save-point into the database and the save-point will be retrieved if the user does undo. Commit also executes all messages. Please note that you need to also to save the drawings database to persists the changes to disk.
 (Inherited from Drawing.)
CommitChanges(String)
 Commits the changes made to the drawings database so far. Commit inserts a kind of save-point into the database and the save-point will be retrieved if the user does undo. Commit also executes all messages. Please note that you need to also to save the drawings database to persists the changes to disk.
 (Inherited from Drawing.)
Delete
 Deletes the drawing. An active drawing cannot be deleted.
 (Inherited from Drawing.)
GetDoubleUserProperties(Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetDoubleUserProperties(List<String>, Dictionary<String, Double>)
 Retrieves all double user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetIntegerUserProperties(List<String>, Dictionary<String, Int32>)
 Retrieves all integer user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetPlotFileName
Get plot file name.
 (Inherited from Drawing.)
GetPlotFileNameExt
Get plot file name.
 (Inherited from Drawing.)
GetSheet
 Gets the sheet of the drawing.
 (Inherited from Drawing.)
GetStringUserProperties(Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetStringUserProperties(List<String>, Dictionary<String, String>)
 Retrieves all string user properties for the object with the given list of names.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Double)
 Gets a double property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, Int32)
 Gets an integer property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
GetUserProperty(String, String)
 Gets a string property from the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
Insert
 Not supported.
 (Overrides DatabaseObject.Insert().)
IsSameDatabaseObject
 Returns true if the current object and the given object are referencing the same database object.
 (Inherited from Drawing.)
Modify
 Applies the changes made to the drawing attributes.
 (Overrides DatabaseObject.Modify().)
PlaceViews
 Places views on the sheet. Computes the required size of the views to fit the parts, then places the views so that they fit on the sheet and do not overlap. Adjusts the sheet size if needed.
 (Inherited from Drawing.)
Select
 Selects the drawing.
 (Overrides DatabaseObject.Select().)
SetUserProperty(String, Double)
 Sets a double property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, Int32)
 Sets an integer property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
SetUserProperty(String, String)
 Sets a string property for the drawing object. The object has to be in a drawing before the method can be used.
 (Inherited from DatabaseObject.)
Top
See Also
Reference
MultiDrawing Class
Tekla.Structures.Drawing Namespace